#+title: ORG Mode
#+author: Santiago Neira
#+date: 2024-12-07

* Básico de Emacs
----------------------------------------

- Abrir archivo CTRL + x CTRL + f
- Copiar ALT + w
- Cortar CTRL + w 
- Pegar CTRL + y
- Undo CTRL + /
- Seleccionar todo CTRL + x + h
- Redo 
- CTRL + k elimina línea
- Guardar CTRL + x CTRL + s
- Salir de Emacs CTRL + x CTRL + c

* Buffers
----------------------------------------

- Listar buffers CTRL+x, CTRL+b
- Pantalla completa buffer actual CTRL + x + 1
- Dividir horizontalmente CTRL + x + 2
- Dividir verticalmente CTRL + x + 3
- Cambiar entre buffers CTRL + x + o

* Spreadsheet
-----------------------------------------

- Las tablas comienzan con |
- Con |- más TAB se crea la linea divioria horizontal
- También se puede crear una línea horizontal con CTRL + c + -
- Después de escribir en una celda con TAB te mueves a la siguiente
- Después de apretar TAB la tabla crece y se alinea automáticamente en caso de ser necesario
- ALT + LEFT o RIGHT mueve la columna actual hacia la izquierda o derecha
- ALT + Arriba o Abajo mueve la fila hacia arriba o abajo
- ALT + Shift + Left o Right elimina o agrega una nueva columna
- ALT + Shift + Top o Down elimina o agrega una fila
- CTRL + c + ^ con el cursos en la columna y selecciona la forma de orden
- CTRL + u CTRL + c CTRL + c Itera la tabla para recomputar los valores

| Num | Producto | Cant | Precio Unit | Subtotal |
|-----+----------+------+-------------+----------|
|   1 | Manzanas |    3 |         300 |      900 |
|   2 | Naranjas |    5 |         400 |     2000 |
|   3 | Piñas    |    3 |        2000 |     6000 |
|-----+----------+------+-------------+----------|
|     | TOTAL    |   11 |        2700 |     8900 |
#+TBLFM: $5=$3*$4::@>$3=vsum(@I+1..@II-1)::@>$4=vsum(@I+1..@II-1)::@>$5=vsum(@I+1..@II-1)



** Formulas

- Van al final de la tabla con #+TBLFM:
- Si hay más de una fórmula se separa con ::
- Se coloca ; para separar el formato que se quiere aplicar
- CTRL+u, CTRL+c, CTRL+c para recomputar la tabla
  
*** Referencias

- CTRL + c + ? muestra la info de la celda en la parte posterior
- CTRL + c + } muestra directamente en la tabla la info de columnas y filas
- Referencias pueden ser en formato común letter/number, ej, A1, B2, C10
- Y también en formato @Row$Column, ejemplo, @1$2, @1$1, etc

**** Referencias Relativas

- I representa la primera línea horizontal, II la 2da, y así sucesivamente
- Se puede combinar con + ó - para indicar líneas arriba o debajo de, ejemplo, @I+1 es la fila inmediatamente debajo de la 1era línea horizontal y @I-1 es la línea superior.
- < representa la primera fila y > la última, ejemplo, @>$1, quiere decir la última fila de la columna 1  


* Listas
----------------------------------------

- Las listas no ordenadas comienzan con: -, + o * (esta última con indentación)
- Las listas ordenadas usan un número seguido de punto (.) o paréntesis, ejemplo: 1. ó 1)
 

* Tareas
-----------------------------------------

** Con CTRL-c CTRL-t se cambia entre estados
** TODO Lavar platos <2025-01-25 Sat>
** DONE Aprender Org Mode


* Niveles Colapsables
-------------------------------------------

Con TAB es posible ir colapsando los niveles.
Dolor asit atme consequeum.

** 2do nivel

Lorem ipsum 2do nivel

*** 3er nivel

Lorem ipsum 3er nivel
